@echo off
echo ==============================
echo Зупинка всіх контейнерів...
echo ==============================
docker stop $(docker ps -aq)

echo ==============================
echo Видалення всіх контейнерів...
echo ==============================
docker rm -f $(docker ps -aq)

echo ==============================
echo Видалення всіх образів...
echo ==============================
docker rmi -f $(docker images -q)

echo ==============================
echo Запуск нового контейнера...
echo ==============================
docker-compose up -d --build

echo ==============================
echo Готово!
echo ==============================
pause
